{
  "tr": {
    "1": "Neden programcılar ağaçları sevmez? Çünkü onlara hep dalları çıkarmalarını söylerler!",
    "2": "Neden yazılımcılar kışın daha mutlu olurlar? Çünkü kodlarının karşısında \"sonunda biraz beyaz alan\" görebilirler.",
    "3": "Bilgisayarlar neden kötü şakaları sever? Çünkü bilirler ki, bu şakalar \"byte\"larını almaz.",
    "4": "Bir programcı bir bara gider, barda bir sandalyeye oturur ve \"bir içki alayım\" der. Sandalye: \"Özür dilerim, ama ben sadece 3 bacaklı cihazları hizmet edebilirim\" der.",
    "5": "Bir programcı bir köşeye girer ve \"Hello, World!\" der. Köşe: \"Merhaba, dünya! Seni en son ne zaman gördüm?!\"",
    "6": "Bir programcı bir fincan kahveye girer ve \"Merhaba, biraz sıcaklık alabilir miyim?\" der. Fincan: \"Tabii, ama biraz kütüphanede oturmanız gerekecek.\"",
    "7": "Neden yazılımcılar genellikle tekerlemeleri anlamazlar? Çünkü genellikle \"bug\"ları vardır!",
    "8": "Bir programcı bir yılbaşı partisine gider ve \"Countdown timer'ı nerde?\" diye sorar. Ev sahibi: \"İki dakika sonra burada olacak.\" der. Programcı: \"İki dakika sonra burada olacak mı?\" der. Ev sahibi: \"Evet, o zaman onu göstermek için bir loop kurdum!\"",
    "9": "Neden programcılar balık tutmayı sevmezler? Çünkü onlar hep \"catch\" bloklarını kullanmak zorundadırlar!",
    "10": "Programcılar neden film izlemekten hoşlanmazlar? Çünkü bir şey \"Runtime Error\" vermedikçe, gerçek hayattan kopamazlar.",
    "11": "Bir programcı bir restorana girer ve \"Beni neyinizi recommodate edersiniz?\" diye sorar. Garson: \"Size bizim 'server side' önerilerimizden birini getireyim!\"",
    "12": "Neden bilgisayarlar zor soruları sevmez? Çünkü hep \"hard disk\"lerini kullanmak zorunda kalırlar!",
    "13": "Programcılar neden açık havada kamp yapmaktan hoşlanmazlar? Çünkü orada hep \"debugging\" yapmak zorunda kalırlar!",
    "14": "Neden bir programcının en sevdiği tatil yerleri plajlar değildir? Çünkü hep \"sand\"larla doludur!",
    "15": "Bir programcı bir taksiye biner ve \"Lütfen, beni 'home' adresime götürün!\" der. Taksi şoförü: \"Evet, ama bu işlem biraz uzun sürebilir. Güncelleme işlemine başlıyorum!\"",
    "16": "Neden yazılımcılar genellikle yalnız yemek yerler? Çünkü diğer insanlarla \"fork\" etmek istemezler!",
    "17": "Neden bir bilgisayar bir arkadaş edinemiyor? Çünkü hep \"input\" alırlar ama \"output\" veremezler!",
    "18": "Bir programcı bir bankaya gider ve \"Bir 'interface' açabilir miyim?\" diye sorar. Bankacı: \"Tabii, ama önceki 'interface'lerinizin tüm sürümlerini bize göndermeniz gerekiyor!\"",
    "19": "Neden programcılar genellikle yürümeyi tercih etmezler? Çünkü hep \"running\" olmaktan yorulurlar!",
    "20": "Bir programcı bir markete girer ve \"Biraz RAM alabilir miyim?\" diye sorar. Satıcı: \"Tabii, kaç GB olacak?\" der. Programcı: \"Biraz fazlasını alayım, belki bir gün 'memory leak' yaşarım!\""
  },
  "en": {
    "1": "Why don't programmers like trees? Because they always tell them to branch out!",
    "2": "Why are programmers happier in winter? Because they can see a bit of white space at the end of their code.",
    "3": "Why do computers love bad jokes? Because they know these jokes won't take up any 'byte's.",
    "4": "A programmer walks into a bar, sits on a chair, and says, 'I'll have a drink.' The chair: 'Sorry, but I can only serve 3-legged devices.'",
    "5": "A programmer walks into a corner and says, 'Hello, World!' The corner: 'Hello, world! When was the last time I saw you?!'",
    "6": "A programmer walks into a coffee cup and says, 'Hello, can I have some warmth?' The cup: 'Sure, but you'll need to sit in the library for a while.'",
    "7": "Why don't programmers usually understand nursery rhymes? Because they usually have 'bugs'!",
    "8": "A programmer goes to a New Year's Eve party and asks, 'Where's the countdown timer?' Host: 'It'll be here in two minutes.' Programmer: 'Will it be here in two minutes?' Host: 'Yes, I've set up a loop to show it!'",
    "9": "Why don't programmers like fishing? Because they always have to use 'catch' blocks!",
    "10": "Why don't programmers enjoy watching movies? Because they can't disconnect from real life unless something gives a 'Runtime Error'.",
    "11": "A programmer goes into a restaurant and asks, 'What do you recommend me to recommodate?' Waiter: 'Let me bring you one of our 'server-side' recommendations!'",
    "12": "Why don't computers like tough questions? Because they always have to use their 'hard disk's!",
    "13": "Why don't programmers enjoy camping outdoors? Because they always have to do 'debugging' there!",
    "14": "Why aren't beaches programmers' favorite holiday spots? Because they're always full of 'sand's!",
    "15": "A programmer gets into a taxi and says, 'Please, take me to my 'home' address!' The taxi driver: 'Sure, but this operation might take a bit long. Starting the update process!'",
    "16": "Why do programmers often eat alone? Because they don't want to 'fork' with other people!",
    "17": "Why can't a computer make friends? Because it always takes 'input's but can't give 'output's!",
    "18": "A programmer goes to a bank and asks, 'Can I open an 'interface'?' Banker: 'Sure, but you need to send us all the versions of your previous 'interfaces' first!'",
    "19": "Why don't programmers prefer walking? Because they get tired of always being 'running'!",
    "20": "A programmer goes to a grocery store and asks, 'Can I get some RAM?' Salesperson: 'Sure, how many GBs?' Programmer: 'Give me a bit more, maybe one day I'll have a 'memory leak'!'"
  }
}