{
  "tr": {
    "1": "Başarısızlık, başarının öncüsüdür. Bu yüzden, hata yapmaktan korkma ve her hata bir adım daha ileriye gitmek anlamına gelir.",
    "2": "Bir bilgisayar gibi düşün: Herkesin günlük hayatında hata yapma hakkı vardır ve her hata, sistemini güncellemesine yardımcı olur.",
    "3": "Yoldaki tüm engeller, senin güçlüğünü test etmek için değil, başarılı olmanı kutlamak için vardır. Her zorluk, senin daha da güçlenmeni sağlar.",
    "4": "Bir kodcunun en büyük yeteneği, çözülmesi gereken sorunlara karşı motivasyonunu kaybetmemesidir. Her sorun, yeni bir fırsat demektir.",
    "5": "Yazılım geliştiricileri, her satır kodunun kendi hikayesini anlattığını bilirler. Sen de her adımında, kendi hikayeni yazıyorsun.",
    "6": "Başarı, bugün yaptığın küçük adımlardan gelir. Küçük başarılar, büyük zaferlerin yolunu açar.",
    "7": "Herkesin bir başlangıç noktası vardır ve her başlangıç, potansiyelini sergilemenin ilk adımıdır. Sen de potansiyelini göstermek için başla!",
    "8": "Başarı, sabır ve azimle gelir. Her adımında sabırlı ol ve hedeflerine azimle ilerle.",
    "9": "Kodlama yolculuğunda zorluklarla karşılaşabilirsin, ama her zorluk, sadece daha güçlü ve daha bilgili hale gelmeni sağlar.",
    "10": "Başarı, sadece düşmeyi değil, her düştüğünde tekrar kalkmayı da içerir. Her düşüş, daha da güçlenmen için bir fırsattır.",
    "11": "Her gün, kendinden biraz daha iyi olmak için bir fırsattır. Bugün, yarının başarısının temelini oluşturur.",
    "12": "Bir problem karşısında pes etmek yerine, onu çözmek için yeni yollar bul. Her problem, senin yaratıcılığını tetikler.",
    "13": "Kodlama yolculuğunda en önemli şey, sürekli olarak öğrenmeye ve gelişmeye açık olmaktır. Her gün bir şeyler öğren ve kendini geliştir.",
    "14": "Başarı, zaman zaman düşmekle değil, her düştüğünde yeniden kalkmayı bilmeyle ölçülür. Her kalkış, senin daha da güçlenmeni sağlar.",
    "15": "Her kod satırı, bir sonraki başarı öykünün bir parçasıdır. Sen de her satırda, kendi başarı öykünü yazıyorsun.",
    "16": "Başarı, yalnızca zirveye ulaşmakla değil, zirveye ulaşmak için attığın her adımla ilgilidir. Her adım, seni hedefine biraz daha yaklaştırır.",
    "17": "Başarılı olmak için önce inanmalısın. İnanç, başarının anahtarıdır. Kendine güven ve hedeflerine ulaşmak için çalışmaya devam et.",
    "18": "Yolun bazen en zor olduğunda, gerçek potansiyelini ortaya çıkarırsın. Her zorluk, senin gücünü ve dayanıklılığını test eder.",
    "19": "Başarılı olmak için sürekli olarak çaba göster. Her gün biraz daha iyisini yapmaya çalış ve başarı kaçınılmaz olacaktır.",
    "20": "Bir başkasının başarısı, senin başarısız olduğun anlamına gelmez. Herkesin kendi hızı ve yolu vardır. Sen de kendi yolunda ilerle ve başarılı ol."
  },
  "en": {
    "1": "Failure is the precursor to success. So, don't be afraid to make mistakes and every mistake means a step forward.",
    "2": "Think like a computer: Everyone has the right to make mistakes in their daily life and every mistake helps to update their system.",
    "3": "All obstacles on the road are not there to test your difficulty, but to celebrate your success. Every difficulty makes you stronger.",
    "4": "The greatest ability of a coder is not to lose motivation against the problems to be solved. Every problem means a new opportunity.",
    "5": "Software developers know that every line of code tells its own story. You are also writing your own story at every step.",
    "6": "Success comes from the small steps you take today. Small successes pave the way for great victories.",
    "7": "Everyone has a starting point and every start is the first step to showcase your potential. Start to show your potential!",
    "8": "Success comes with patience and perseverance. Be patient at every step and move towards your goals with perseverance.",
    "9": "You may encounter difficulties on your coding journey, but every difficulty only makes you stronger and more knowledgeable.",
    "10": "Success includes not only falling, but also getting up every time you fall. Every fall is an opportunity for you to become stronger.",
    "11": "Every day is an opportunity to be a little better than yourself. Today lays the foundation for tomorrow's success.",
    "12": "Instead of giving up in the face of a problem, find new ways to solve it. Every problem triggers your creativity.",
    "13": "The most important thing on the coding journey is to be open to learning and development. Learn something new every day and improve yourself.",
    "14": "Success is measured not only by falling from time to time, but by knowing how to get up every time you fall. Every rise makes you stronger.",
    "15": "Every line of code is part of your next success story. You are also writing your own success story at every line.",
    "16": "Success is not only about reaching the top, but about every step you take to reach the top. Every step brings you a little closer to your goal.",
    "17": "You must believe first to be successful. Belief is the key to success. Trust yourself and keep working to achieve your goals.",
    "18": "When the road is sometimes the hardest, you reveal your true potential. Every difficulty tests your strength and resilience.",
    "19": "Make continuous effort to be successful. Try to do a little better every day and success will be inevitable.",
    "20": "Another's success does not mean you have failed. Everyone has their own pace and path. You also move forward on your own path and be successful."
  }
}
